Revit 2024 API
BuiltInFailures.PipingFailures.PartNotFoundInRoutingPreferenceError Property
 "%1s is not found. Please review the routing preference of %2s."
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PartNotFoundInRoutingPreferenceError { get; }
Visual Basic
Public Shared ReadOnly Property PartNotFoundInRoutingPreferenceError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PartNotFoundInRoutingPreferenceError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.PipingFailures Class
Autodesk.Revit.DB Namespace